text/05-truth-table-generator.org
#+title: Chapter 5 : Truth table generator
* <<intro>>

In this chapter we shall write a program which reads formulas in propositional logic and writes their truth table.  The input language for the formulas uses infix notation, but the various binary operators have different precedences and they can be repeated.  This minimises the need for parentheses and hence makes formulas much easier to read.

* User manual

The program TRUTAB repeatedly reads formulas in propositional logic and writes truth tables.  The formulas consist of atoms which are constants or variables, together with truth functional operators written in infix notation.  For the truth tables, the program generates all combinations of truth values for the propositional variables that occur in a given formula, and for each combination it evaluates the formula.

The program indicates its readiness for user input with a =?= as a prompt.  The grammar for user input is given by the following BNF grammar, where =|= denotes alternation, =[= and =]= denote indefinite repetition, and ={= and =}= denote option.  There are the following five productions:

#+begin_example bnf
input        ::=   [formula '.'] | '.'
formula      ::=   expression {('>' | '=') formula}
expression   ::=   term ['v' term]
term         ::=   factor ['&' factor]
factor       ::=   'a' | 'b' .. 'z' |
                   '0' | '1' |
                   '-' factor |
                   '(' formula ')'
#+end_example

White space characters such as blanks, tabs and newlines are ignored.  If an error occurs during input, an error message is given and the remainder of the current input line is discarded.  If the offending character is =X=, then the error message will be one of the following:

#+begin_example
        seen "X" when "." expected
        seen "X" when beginning of factor expected
        seen "X" when right parenthesis expected
#+end_example

For each correct input formula a truth table is produced.  For a formula with N propositional variables =a= .. =z=, the table consists of a header line and 2^N lines of truth values.  The header line consists of the variables in the formula, in alphabetical order and separated by a space.  The lines of truth values consist of the truth values of the propositional variables, written under the names of the variables in the header line, then a separating space =" "=, followed by the truth value of the formula.  Note that if the formula only contains the constants =0= and =1=, then N=0 and hence there will be 2^0=1 line in the table, containing just the truth value of the formula.

The truth value of the formula is computed from the truth values of its subformulas, as follows: The constants =0= and =1= evaluate to themselves.  Variables evaluate to the value given by the row.  Compound formulas are evaluated in accordance with these tables, where =p= and =q= are arbitrary formulas:

#+begin_example
    p q   |     p v q   p & q   p > q   p = q           p   |   -p
    ------+----------------------------------           ----+-----
    1 1   |       1       1       1       1             1   |   0
    1 0   |       1       0       0       0             0   |   1
    0 1   |       1       0       1       0
    0 0   |       0       0       1       1
#+end_example

The following is a short interaction with the program.

#+begin_example
?  p & (q v r)  =  (p & q) v (p & r).
p q r 
1 1 1     1
1 1 0     1
1 0 1     1
1 0 0     1
0 1 1     1
0 1 0     1
0 0 1     1
0 0 0     1
?  p & -p.
p 
1     0
0     0
?  (a v -b) = -(b & a).
a b 
1 1     0
1 0     1
0 1     0
0 0     1
?  (1 & 0) v 1.

    1
?  .
#+end_example

Observe how each input line, following the =?= prompt, is followed by a formula.  The next line is output from the program, it contains just the propositional variables in the formula, 3, 1, 2 and 0 in the examples.  Following that are the 2^N lines of the truth table.  Note that in these lines the truth value of the formula is /not/ written under the main operator; such a desirable refinement is part of one of the exercises.

* Designing the implementation

When writing a truth table by hand, we essentially do this: Starting with an assignment of true to all propositional variables that occur in the given formula, we successively generate lines by changing assignments to variables, and for each line we evaluate the formula using the definitions of the operators and using the currently assigned values of the variables.  So the formula is needed repeatedly, and in the program it will have to be read and stored.  As a first design stage, then, the main program has to have this structure: Repeatedly write a prompt, read a formula and store it in internal form, check for the final period =.=, and then do a truth table on the internal form.  >From the grammar it is easily seen that the definition of formula is (indirectly) recursive, so reading a formula and storing it in internal form is best done by a separate procedure.  Also, writing a truth table is essentially a recursive process, so this will be done by a recursive procedure too.

** The translation to internal form

