05-truth-table-generator.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Chapter 5 : Truth table generator</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Chapter 5 : Truth table generator"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-01-11 07:38:09 CST"/>
<meta name="author" content="michal"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Chapter 5 : Truth table generator</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 intro</a></li>
<li><a href="#sec-2">2 User manual</a></li>
<li><a href="#sec-3">3 Designing the implementation</a>
<ul>
<li><a href="#sec-3-1">3.1 The translation to internal form</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1 Step 1: <i>Visibility requirements</i>.</a></li>
<li><a href="#sec-3-1-2">3.1.2 Step 2: <i>Parsing</i>.</a></li>
<li><a href="#sec-3-1-3">3.1.3 Step 3: <i>Selecting an internal code</i>.</a></li>
<li><a href="#sec-3-1-4">3.1.4 Step 4: <i>Translation - Generating postfix code</i>.</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2 The truth table generator</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1 Step 5: <i>Assigning values to variables</i>.</a></li>
<li><a href="#sec-3-2-2">3.2.2 Step 6: <i>The evaluator</i>.</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">4 The program</a></li>
<li><a href="#sec-5">5 Exercises and reading</a>
<ul>
<li><a href="#sec-5-1">5.1 <i>Better output</i>:</a></li>
<li><a href="#sec-5-2">5.2 <i>Optimisation</i>:</a></li>
<li><a href="#sec-5-3">5.3 <i>Values of subformulas</i>:</a></li>
<li><a href="#sec-5-4">5.4 <i>Symbolic operators</i>:</a></li>
<li><a href="#sec-5-5">5.5 <i>Translator</i>:</a></li>
<li><a href="#sec-5-6">5.6 <i>Text Macros</i>:</a></li>
<li><a href="#sec-5-7">5.7 <i>Syntax Macros</i>:</a></li>
<li><a href="#sec-5-8">5.8 <i>Run Time Calls</i>:</a></li>
<li><a href="#sec-5-9">5.9 <i>A difficult optimisation</i>:</a></li>
<li><a href="#sec-5-10">5.10 <i>Other logics</i>:</a></li>
<li><a href="#sec-5-11">5.11 <i>Cartesian Product</i>:</a></li>
<li><a href="#sec-5-12">5.12 <i>Reading</i>:</a></li>
<li><a href="#sec-5-13">5.13 <i>Petri Nets</i>:</a></li>
<li><a href="#sec-5-14">5.14 <i>Compiling into Pascal</i>:</a></li>
<li><a href="#sec-5-15">5.15 <i>Petri Nets again</i>:</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="target">intro</span></h2>
<div class="outline-text-2" id="text-1">


<p>
In this chapter we shall write a program which reads formulas in propositional logic and writes their truth table.  The input language for the formulas uses infix notation, but the various binary operators have different precedences and they can be repeated.  This minimises the need for parentheses and hence makes formulas much easier to read.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> User manual</h2>
<div class="outline-text-2" id="text-2">


<p>
The program TRUTAB repeatedly reads formulas in propositional logic and writes truth tables.  The formulas consist of atoms which are constants or variables, together with truth functional operators written in infix notation.  For the truth tables, the program generates all combinations of truth values for the propositional variables that occur in a given formula, and for each combination it evaluates the formula.
</p>
<p>
The program indicates its readiness for user input with a <code>?</code> as a prompt.  The grammar for user input is given by the following BNF grammar, where <code>|</code> denotes alternation, <code>[</code> and <code>]</code> denote indefinite repetition, and <code>{</code> and <code>}</code> denote option.  There are the following five productions:
</p>



<pre class="example">input        ::=   [formula '.'] | '.'
formula      ::=   expression {('&gt;' | '=') formula}
expression   ::=   term ['v' term]
term         ::=   factor ['&amp;' factor]
factor       ::=   'a' | 'b' .. 'z' |
                   '0' | '1' |
                   '-' factor |
                   '(' formula ')'
</pre>


<p>
White space characters such as blanks, tabs and newlines are ignored.  If an error occurs during input, an error message is given and the remainder of the current input line is discarded.  If the offending character is <code>X</code>, then the error message will be one of the following:
</p>



<pre class="example">seen "X" when "." expected
seen "X" when beginning of factor expected
seen "X" when right parenthesis expected
</pre>


<p>
For each correct input formula a truth table is produced.  For a formula with N propositional variables <code>a</code> .. <code>z</code>, the table consists of a header line and 2<sup>N</sup> lines of truth values.  The header line consists of the variables in the formula, in alphabetical order and separated by a space.  The lines of truth values consist of the truth values of the propositional variables, written under the names of the variables in the header line, then a separating space =" "=, followed by the truth value of the formula.  Note that if the formula only contains the constants <code>0</code> and <code>1</code>, then N=0 and hence there will be 2<sup>0</sup>=1 line in the table, containing just the truth value of the formula.
</p>
<p>
The truth value of the formula is computed from the truth values of its subformulas, as follows: The constants <code>0</code> and <code>1</code> evaluate to themselves.  Variables evaluate to the value given by the row.  Compound formulas are evaluated in accordance with these tables, where <code>p</code> and <code>q</code> are arbitrary formulas:
</p>



<pre class="example">p q   |     p v q   p &amp; q   p &gt; q   p = q           p   |   -p
------+----------------------------------           ----+-----
1 1   |       1       1       1       1             1   |   0
1 0   |       1       0       0       0             0   |   1
0 1   |       1       0       1       0
0 0   |       0       0       1       1
</pre>


<p>
The following is a short interaction with the program.
</p>



<pre class="example">?  p &amp; (q v r)  =  (p &amp; q) v (p &amp; r).
p q r 
1 1 1     1
1 1 0     1
1 0 1     1
1 0 0     1
0 1 1     1
0 1 0     1
0 0 1     1
0 0 0     1
?  p &amp; -p.
p 
1     0
0     0
?  (a v -b) = -(b &amp; a).
a b 
1 1     0
1 0     1
0 1     0
0 0     1
?  (1 &amp; 0) v 1.

    1
?  .
</pre>


<p>
Observe how each input line, following the <code>?</code> prompt, is followed by a formula.  The next line is output from the program, it contains just the propositional variables in the formula, 3, 1, 2 and 0 in the examples.  Following that are the 2<sup>N</sup> lines of the truth table.  Note that in these lines the truth value of the formula is <i>not</i> written under the main operator; such a desirable refinement is part of one of the exercises.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Designing the implementation</h2>
<div class="outline-text-2" id="text-3">


<p>
When writing a truth table by hand, we essentially do this: Starting with an assignment of true to all propositional variables that occur in the given formula, we successively generate lines by changing assignments to variables, and for each line we evaluate the formula using the definitions of the operators and using the currently assigned values of the variables.  So the formula is needed repeatedly, and in the program it will have to be read and stored.  As a first design stage, then, the main program has to have this structure: Repeatedly write a prompt, read a formula and store it in internal form, check for the final period <code>.</code>, and then do a truth table on the internal form.  &gt;From the grammar it is easily seen that the definition of formula is (indirectly) recursive, so reading a formula and storing it in internal form is best done by a separate procedure.  Also, writing a truth table is essentially a recursive process, so this will be done by a recursive procedure too.
</p>

</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> The translation to internal form</h3>
<div class="outline-text-3" id="text-3-1">



</div>
