text/05-truth-table-generator.org
*** Step 1: /Visibility requirements/.

Our first task is to design a procedure for reading and storing formulas, and we concentrate on the reading first.  In the grammar there are actually four non-terminals: =formula=, =expression=, =term= and =factor=; each of them becomes a reading or parsing procedure.  They have to be arranged in such a way that for any given procedure the ones that it may call are visible to it.  Inspection of the grammar reveals that =formula= needs =expression= and itself, =expression= needs =term=, =term= needs =factor=, and =factor= needs itself and =formula=.  A convenient spin-off from the block structure of Pascal is that it makes it easy to satisfy these requirements, by arranging the procedures in this way:

#+begin_example pascal
        PROCEDURE formula;
            PROCEDURE expression;
                PROCEDURE term;
                    PROCEDURE factor;
                    Body of factor;
                Body of term;
            Body of expression;
        Body of formula;
#+end_example

Any procedure can call itself and any more global procedure to its left and any (at most one here) local procedure one step to its right.  This more than satisfies the visibility requirements for the parser.  typical for languages with several infix operators of different precedences.

*** Step 2: /Parsing/.

The bodies of each of the four parsing procedures follow the BNF grammar in essential structure: inside =formula= the curly ={ }= braces become an =IF= statement, inside /expression/ and =term= the square =[ ]= brackets become =WHILE= statements, and the choice inside =factor= becomes the by now familiar =CASE= statement.  An important point to note is that in some of the detail the parsing procedures have to be different from the parsing procedures for the prefix and the fully parenthesised infix grammars in earlier chapters.  This arises because all infix operators are optional here, so the parsing procedures that deal with them must be able to inspect the next printing character and then either take some appropriate action or ignore it.  That so far ignored character is still sitting there, where it might be picked up by another parsing procedure, or it may be the terminating period.  This also explains why a grammar with optional infix operators needs either a terminator or outermost parentheses.  Hence the body of, for example, =PROCEDURE= =term= has to look like this:

#+begin_example
        factor;
        WHILE ch = '&' DO
            BEGIN
            getch;
            factor
            END
#+end_example

For the same reason =PROCEDURE= =factor= does not start with a call to =getch=, but inspects the current character.  And finally, in the main program the initial call to =formula= has to be preceded by a call to =getch= and has to be followed by a check for the terminator.  As described up to this point, the parsing procedures merely read formulas and perhaps complain about the two sorts of errors that can occur inside =factor=.  If you are writing the program yourself, you should get this part right first.

*** Step 3: /Selecting an internal code/.

The procedures do not yet store the formula in internal form.  The formula could be stored in an internal form which is identical to the external form being read --- this was the method used in the macro expander, and it was appropriate there.  Even blanks could be stored, and in that case the storing should be done inside the =REPEAT= loop of =getch=.  But blanks are not really needed, since they are semantically insignificant; so the storing could be done after the =REPEAT= loop of =getch=.  This method would store all the printing characters, including parentheses.  But do we really need these?  After all, they merely serve to override precedences, and precedences are there to save parentheses (Huh?).  For later processing by the truth table generator only essential semantic information is needed, as could be provided by prefix or postfix notation.  (In Chapter 7 we shall see another internal notation.)  It is best to think ahead now and consider how the internal code will be used in the evaluator part of the truth table generator.  The simplest evaluators are recursive, like the infix evaluator in Chapter 3.  Another kind of evaluator uses postfix code which is evaluated on an explicit stack of intermediate values.  The details are described later.

*** Step 4: /Translation - Generating postfix code/.

As postfix alphabet we take the original infix alphabet, except that for disjunction we use =#= to avoid confusion with the variable =v=.  Generating postfix code is done by inserting appropriate calls to a code generating routine into the parsers.  Inside =factor=, code generation is straightforward in the case of constants and variables.  Negations are generated after the negand, another factor, has been read and its code generated.  For infix operators the code can be generated after the second subformula has been read and translated.  Note that the code for =p & q & r= will be =pq&r&=, this has the advantage that the stack will not grow unnecessarily.  But =p > q > r= should be understood as =p > (q > r)=, and this should be translated as =pqr>>=.  For this reason the grammar already makes a distinction between =&= and =v= on the one hand, and =>= on the other.  Another minor point is that inside the parsing procedure for =formula= a local variable has to be used to save which of =>= or === had been seen.  Since code has to be generated at several places in the parser, the task is best delegated to a procedure which takes a character parameter.  Its body is similar to where the macro expander stores characters of macros: it increments the variable which indicates the last used part of memory and then deposits its parameter there.

To be able to check that the postfix code is correct, it is useful to be able to see it when developing the program.  The following device is on purpose not documented in the manual: If the formula is not terminated with a period but with a question mark instead, then the program will write out the internal representation of the formula before doing the truth table.  A similar /secret/ device, known to the implementor but not documented in the manual, will be used in many other programs in this book.  Such a device can save endless editing sessions of adding and removing write statements which trace values of variables and of parameters.  The method is probably more useful than a debugger.

** The truth table generator

The truth table generator receives the internal version of the formula, repeatedly assigns various values to the propositional variables in the formula, and for each complete assignment it evaluates the formula.  Assigning values and evaluating are two distinct tasks.

