05-truth-table-generator.html

<div id="outline-container-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Step 1: <i>Visibility requirements</i>.</h4>
<div class="outline-text-4" id="text-3-1-1">


<p>
Our first task is to design a procedure for reading and storing formulas, and we concentrate on the reading first.  In the grammar there are actually four non-terminals: <code>formula</code>, <code>expression</code>, <code>term</code> and <code>factor</code>; each of them becomes a reading or parsing procedure.  They have to be arranged in such a way that for any given procedure the ones that it may call are visible to it.  Inspection of the grammar reveals that <code>formula</code> needs <code>expression</code> and itself, <code>expression</code> needs <code>term</code>, <code>term</code> needs <code>factor</code>, and <code>factor</code> needs itself and <code>formula</code>.  A convenient spin-off from the block structure of Pascal is that it makes it easy to satisfy these requirements, by arranging the procedures in this way:
</p>



<pre class="example">PROCEDURE formula;
    PROCEDURE expression;
        PROCEDURE term;
            PROCEDURE factor;
            Body of factor;
        Body of term;
    Body of expression;
Body of formula;
</pre>


<p>
Any procedure can call itself and any more global procedure to its left and any (at most one here) local procedure one step to its right.  This more than satisfies the visibility requirements for the parser.  typical for languages with several infix operators of different precedences.
</p>
</div>

</div>

<div id="outline-container-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Step 2: <i>Parsing</i>.</h4>
<div class="outline-text-4" id="text-3-1-2">


<p>
The bodies of each of the four parsing procedures follow the BNF grammar in essential structure: inside <code>formula</code> the curly <code>{ }</code> braces become an <code>IF</code> statement, inside <i>expression</i> and <code>term</code> the square <code>[ ]</code> brackets become <code>WHILE</code> statements, and the choice inside <code>factor</code> becomes the by now familiar <code>CASE</code> statement.  An important point to note is that in some of the detail the parsing procedures have to be different from the parsing procedures for the prefix and the fully parenthesised infix grammars in earlier chapters.  This arises because all infix operators are optional here, so the parsing procedures that deal with them must be able to inspect the next printing character and then either take some appropriate action or ignore it.  That so far ignored character is still sitting there, where it might be picked up by another parsing procedure, or it may be the terminating period.  This also explains why a grammar with optional infix operators needs either a terminator or outermost parentheses.  Hence the body of, for example, <code>PROCEDURE</code> <code>term</code> has to look like this:
</p>



<pre class="example">factor;
WHILE ch = '&amp;' DO
    BEGIN
    getch;
    factor
    END
</pre>


<p>
For the same reason <code>PROCEDURE</code> <code>factor</code> does not start with a call to <code>getch</code>, but inspects the current character.  And finally, in the main program the initial call to <code>formula</code> has to be preceded by a call to <code>getch</code> and has to be followed by a check for the terminator.  As described up to this point, the parsing procedures merely read formulas and perhaps complain about the two sorts of errors that can occur inside <code>factor</code>.  If you are writing the program yourself, you should get this part right first.
</p>
</div>

</div>

<div id="outline-container-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> Step 3: <i>Selecting an internal code</i>.</h4>
<div class="outline-text-4" id="text-3-1-3">


<p>
The procedures do not yet store the formula in internal form.  The formula could be stored in an internal form which is identical to the external form being read &mdash; this was the method used in the macro expander, and it was appropriate there.  Even blanks could be stored, and in that case the storing should be done inside the <code>REPEAT</code> loop of <code>getch</code>.  But blanks are not really needed, since they are semantically insignificant; so the storing could be done after the <code>REPEAT</code> loop of <code>getch</code>.  This method would store all the printing characters, including parentheses.  But do we really need these?  After all, they merely serve to override precedences, and precedences are there to save parentheses (Huh?).  For later processing by the truth table generator only essential semantic information is needed, as could be provided by prefix or postfix notation.  (In Chapter 7 we shall see another internal notation.)  It is best to think ahead now and consider how the internal code will be used in the evaluator part of the truth table generator.  The simplest evaluators are recursive, like the infix evaluator in Chapter 3.  Another kind of evaluator uses postfix code which is evaluated on an explicit stack of intermediate values.  The details are described later.
</p>
</div>

</div>

<div id="outline-container-3-1-4" class="outline-4">
<h4 id="sec-3-1-4"><span class="section-number-4">3.1.4</span> Step 4: <i>Translation - Generating postfix code</i>.</h4>
<div class="outline-text-4" id="text-3-1-4">


<p>
As postfix alphabet we take the original infix alphabet, except that for disjunction we use <code>#</code> to avoid confusion with the variable <code>v</code>.  Generating postfix code is done by inserting appropriate calls to a code generating routine into the parsers.  Inside <code>factor</code>, code generation is straightforward in the case of constants and variables.  Negations are generated after the negand, another factor, has been read and its code generated.  For infix operators the code can be generated after the second subformula has been read and translated.  Note that the code for <code>p &amp; q &amp; r</code> will be <code>pq&amp;r&amp;</code>, this has the advantage that the stack will not grow unnecessarily.  But <code>p &gt; q &gt; r</code> should be understood as <code>p &gt; (q &gt; r)</code>, and this should be translated as <code>pqr&gt;&gt;</code>.  For this reason the grammar already makes a distinction between <code>&amp;</code> and <code>v</code> on the one hand, and <code>&gt;</code> on the other.  Another minor point is that inside the parsing procedure for <code>formula</code> a local variable has to be used to save which of <code>&gt;</code> or === had been seen.  Since code has to be generated at several places in the parser, the task is best delegated to a procedure which takes a character parameter.  Its body is similar to where the macro expander stores characters of macros: it increments the variable which indicates the last used part of memory and then deposits its parameter there.
</p>
<p>
To be able to check that the postfix code is correct, it is useful to be able to see it when developing the program.  The following device is on purpose not documented in the manual: If the formula is not terminated with a period but with a question mark instead, then the program will write out the internal representation of the formula before doing the truth table.  A similar <i>secret</i> device, known to the implementor but not documented in the manual, will be used in many other programs in this book.  Such a device can save endless editing sessions of adding and removing write statements which trace values of variables and of parameters.  The method is probably more useful than a debugger.
</p>
</div>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> The truth table generator</h3>
<div class="outline-text-3" id="text-3-2">


<p>
The truth table generator receives the internal version of the formula, repeatedly assigns various values to the propositional variables in the formula, and for each complete assignment it evaluates the formula.  Assigning values and evaluating are two distinct tasks.
</p>

</div>
