text/05-truth-table-generator.org
*** Step 5: /Assigning values to variables/.

Let us begin with the unrealistic case of a formula in which each of the possible 26 possible propositional variables actually occur.  To assign all combinations of truth values to the 26 variables, the program has to make =a= true and continue, and then make =a= false and continue.  Continuing means doing the same to =b=, to =c= and so forth, hence a recursive solution is called for.  When all propositional variables have been assigned, i.e. when =z= has been passed, the recursion stops and the formula can be evaluated.  As a first draft, consider a procedure which is initially called with the actual parameter =a=:

#+begin_example
        PROCEDURE table(v : char);
        BEGIN
        IF v > 'z' THEN evaluate the formula ELSE
            BEGIN
            make variable v true; table(succ(v));
            make variable v false; table(succ(v))
            END
        END;
#+end_example

This is essentially correct for the unrealistic case, but for realistic formulas in which most of the possible 26 variables do not actually occur, something else is needed.  Firstly, before doing the truth table, it is necessary to write the names of all variables that actually occur.  Secondly, in the =table= procedure, when all the variables have been given values, before evaluating the formula, it is necessary to write the values of the variables that actually occur.  Thirdly, when the body of the =table= procedure is entered, the parameter variable should be replaced by the next variable that actually occurs.  So instead of recursing with the next possible variable, =succ(v)=, the alphabetically next actually occurring variable should be used.  A wasteful way of doing so would be to find the next actual variable every time it is needed by searching through the formula.  A better way is to create a set of actual variables as the formula is being read: when =factor= sees a variable, put it into this set.  This set of actual variables is used at each of the three places mentioned.  In the third of these places, the table procedure, the pseudo code now looks like this:

#+begin_example pascal
        PROCEDURE table(v : char);
        BEGIN
        WHILE NOT (v IN the set of actual variables) DO
            v := succ(v);
        IF v > 'z' THEN
            BEGIN
            write the values of all actual variables;
            evaluate the formula
            END
          ELSE
            BEGIN
            make variable v true; table(succ(v));
            make variable v false; table(succ(v))
            END
        END;
#+end_example

To stop the =WHILE= loop from racing off the end, the main program has to put the successor of =z= into the set to act as a sentinel.  There are several ways of making variables true or false --- one is to have a boolean array, another is to have a set of variables that are currently true.

As described, the procedure executes several =WHILE= loops, one for each actually occurring variable, but each loop only traverses a portion of the potential variables.  A further, but probably minor improvement is this: The next actuals can be computed globally after the formula has been read and before it is passed to the =table= procedure.  This can be done by a single =FOR= loop through all the 26 potential variables, and it creates an array which for each actual variables contains the next actual variable.  The loop also finds the first actual variable, and the =table= procedure is then called with this first actual variable as a parameter.  (This optimisation is left as one of the exercises.)

The part of the table generator which generates values of variables is now complete.

*** Step 6: /The evaluator/.

Since the length of the postfix representation is known by the time it is being evaluated, the evaluator can consist of a =FOR= loop which steps through the postfix code, an array of characters.  At each step it examines the current character in the postfix, and depending on what the character is, it does something to a stack of booleans which is initially empty.

1) If the character is one of the two constants, push its value onto the stack; if the character is a propositional variable, look up its current value and push that onto the stack.

2) If the character is =-=, replace the top value on the stack by its negation.

3) If the character is a binary operator, replace the two values on the top by a single value computed from the other two; for example, if the character is =&=, replace the top two values by the value of their conjunction. When the end of the postfix is reached, the stack will contain just one value which is the value of the formula.

Here is an example; for readability the postfix has been spaced out.  Below the postfix code is a trace of the stack; note that /time flows from left to right/.

#+begin_example
                                infix:
                                (p v q v r) & -(s > t > u)
current values:                 postfix:
p q r s t u                     p q # r # s t u > > - &
1 0 1 0 0 1
                                              1
                                            0 0 1
                                  0   1   0 0 0 0 1 0
                        stack:  1 1 1 1 1 1 1 1 1 1 1 0
#+end_example

The stack is best implemented as an =ARRAY= of boolean values, together with an integer variable which is the top.  When the formula has been evaluated, its value can be written, but that value should be preceded on the same line by the current values of each of the actual variables.  Before the main program sends the formula to the table generator, it should write a line with the names of the actual variables.  Both the writing of the current values and the writing of the names makes use of the set of actuals collected during parsing.

