05-truth-table-generator.html

<div id="outline-container-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Step 5: <i>Assigning values to variables</i>.</h4>
<div class="outline-text-4" id="text-3-2-1">


<p>
Let us begin with the unrealistic case of a formula in which each of the possible 26 possible propositional variables actually occur.  To assign all combinations of truth values to the 26 variables, the program has to make <code>a</code> true and continue, and then make <code>a</code> false and continue.  Continuing means doing the same to <code>b</code>, to <code>c</code> and so forth, hence a recursive solution is called for.  When all propositional variables have been assigned, i.e. when <code>z</code> has been passed, the recursion stops and the formula can be evaluated.  As a first draft, consider a procedure which is initially called with the actual parameter <code>a</code>:
</p>



<pre class="example">PROCEDURE table(v : char);
BEGIN
IF v &gt; 'z' THEN evaluate the formula ELSE
    BEGIN
    make variable v true; table(succ(v));
    make variable v false; table(succ(v))
    END
END;
</pre>


<p>
This is essentially correct for the unrealistic case, but for realistic formulas in which most of the possible 26 variables do not actually occur, something else is needed.  Firstly, before doing the truth table, it is necessary to write the names of all variables that actually occur.  Secondly, in the <code>table</code> procedure, when all the variables have been given values, before evaluating the formula, it is necessary to write the values of the variables that actually occur.  Thirdly, when the body of the <code>table</code> procedure is entered, the parameter variable should be replaced by the next variable that actually occurs.  So instead of recursing with the next possible variable, <code>succ(v)</code>, the alphabetically next actually occurring variable should be used.  A wasteful way of doing so would be to find the next actual variable every time it is needed by searching through the formula.  A better way is to create a set of actual variables as the formula is being read: when <code>factor</code> sees a variable, put it into this set.  This set of actual variables is used at each of the three places mentioned.  In the third of these places, the table procedure, the pseudo code now looks like this:
</p>



<pre class="example">PROCEDURE table(v : char);
BEGIN
WHILE NOT (v IN the set of actual variables) DO
    v := succ(v);
IF v &gt; 'z' THEN
    BEGIN
    write the values of all actual variables;
    evaluate the formula
    END
  ELSE
    BEGIN
    make variable v true; table(succ(v));
    make variable v false; table(succ(v))
    END
END;
</pre>


<p>
To stop the <code>WHILE</code> loop from racing off the end, the main program has to put the successor of <code>z</code> into the set to act as a sentinel.  There are several ways of making variables true or false &mdash; one is to have a boolean array, another is to have a set of variables that are currently true.
</p>
<p>
As described, the procedure executes several <code>WHILE</code> loops, one for each actually occurring variable, but each loop only traverses a portion of the potential variables.  A further, but probably minor improvement is this: The next actuals can be computed globally after the formula has been read and before it is passed to the <code>table</code> procedure.  This can be done by a single <code>FOR</code> loop through all the 26 potential variables, and it creates an array which for each actual variables contains the next actual variable.  The loop also finds the first actual variable, and the <code>table</code> procedure is then called with this first actual variable as a parameter.  (This optimisation is left as one of the exercises.)
</p>
<p>
The part of the table generator which generates values of variables is now complete.
</p>
</div>

</div>

<div id="outline-container-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> Step 6: <i>The evaluator</i>.</h4>
<div class="outline-text-4" id="text-3-2-2">


<p>
Since the length of the postfix representation is known by the time it is being evaluated, the evaluator can consist of a <code>FOR</code> loop which steps through the postfix code, an array of characters.  At each step it examines the current character in the postfix, and depending on what the character is, it does something to a stack of booleans which is initially empty.
</p>
<ol>
<li>If the character is one of the two constants, push its value onto the stack; if the character is a propositional variable, look up its current value and push that onto the stack.

</li>
<li>If the character is <code>-</code>, replace the top value on the stack by its negation.

</li>
<li>If the character is a binary operator, replace the two values on the top by a single value computed from the other two; for example, if the character is <code>&amp;</code>, replace the top two values by the value of their conjunction. When the end of the postfix is reached, the stack will contain just one value which is the value of the formula.
</li>
</ol>


<p>
Here is an example; for readability the postfix has been spaced out.  Below the postfix code is a trace of the stack; note that <i>time flows from left to right</i>.
</p>



<pre class="example">                                infix:
                                (p v q v r) &amp; -(s &gt; t &gt; u)
current values:                 postfix:
p q r s t u                     p q # r # s t u &gt; &gt; - &amp;
1 0 1 0 0 1
                                              1
                                            0 0 1
                                  0   1   0 0 0 0 1 0
                        stack:  1 1 1 1 1 1 1 1 1 1 1 0
</pre>


<p>
The stack is best implemented as an <code>ARRAY</code> of boolean values, together with an integer variable which is the top.  When the formula has been evaluated, its value can be written, but that value should be preceded on the same line by the current values of each of the actual variables.  Before the main program sends the formula to the table generator, it should write a line with the names of the actual variables.  Both the writing of the current values and the writing of the names makes use of the set of actuals collected during parsing.
</p>
</div>
</div>
</div>

</div>
