text/05-truth-table-generator.org
* The program

The following is the standard Pascal source for the truth table program TRUTAB.

#+begin_src pascal
PROGRAM truthtable(input,output);

LABEL 1, 99;

CONST
    maxcode = 200;
    maxstack = 30;

TYPE
    message = PACKED ARRAY [1..30] OF char;

VAR
    ch : char;
    code : ARRAY [1..maxcode] OF char;
    codeindex : integer;

    occurrences,truevars  : SET OF char;
    c : char;

    i : integer;

PROCEDURE error(mes : message);
BEGIN (* error *)
writeln('seen "',ch,'" when ',mes);
readln;
GOTO 1
END; (* error *)

PROCEDURE getch;
BEGIN (* getch *)
REPEAT
    IF eof THEN goto 99;
    read(ch);
    write(ch)   (* for batch use *)
    UNTIL ch > ' '
END; (* getch *)

PROCEDURE generate(o : char);
BEGIN (* generate *)
codeindex  :=  codeindex + 1;
code[codeindex] := o
END; (* generate *)

(* - - - - -  T R A N S L A T O R  - - - - - *)

PROCEDURE formula;
VAR localchar : char;

    PROCEDURE expression;

        PROCEDURE term;

            PROCEDURE factor;
            BEGIN
            CASE ch of
                'a','b','c','d','e','f','g','h','i',
                'j','k','l','m','n','o','p','q','r',
                's','t','u','v','w','x','y','z',
                '0','1' :
                    BEGIN
                    generate(ch);
                    occurrences := occurrences + [ch];
                    getch
                    END;
                '-' :
                    BEGIN
                    getch;
                    factor;
                    generate('-')
                    END;
                '(' :
                    BEGIN
                    getch;
                    formula;
                    IF ch = ')' THEN getch ELSE
                        error('right parenthesis expected    ')
                    END
                OTHERWISE
                    error('beginning of factor expected  ');
                END (* CASE *)
            END; (* factor *)

        BEGIN (* term *)
        factor;
        WHILE ch = '&' DO
            BEGIN
            getch;
            factor;
            generate('&')
            END (* WHILE *)
        END; (* term *)

    BEGIN (* expression *)
    term;
    WHILE ch IN ['#','v'] DO
        BEGIN
        getch;
        term;
        generate('#')
        END (* WHILE *)
    END; (* expression *)

BEGIN (* formula *)
expression;
IF (ch = '>') OR (ch = '=') THEN
    BEGIN
    localchar := ch;
    getch;
    formula;
    generate(localchar)
    END (* WHILE *)
END; (* formula *)

(* - - - - -  T A B L E   G E N E R A T O R  - - - - - *)

PROCEDURE table(v : char);
VAR c : char;

    FUNCTION val : boolean;
    VAR
        s : ARRAY [1..maxstack] OF boolean;
        t : integer; (* top of stack *)
        i : integer;
    BEGIN (* val *)
    t := 0;
    FOR i := 1 TO codeindex DO
        CASE code[i] OF
            'a','b','c','d','e','f','g','h','i','j','k','l','m',
            'n','o','p','q','r','s','t','u','v','w','x','y','z' :
                  BEGIN t := t+1; s[t] := code[i] IN truevars END;
            '1' : BEGIN t := t+1; s[t] := true                END;
            '0' : BEGIN t := t+1; s[t] := false               END;
            '-' : BEGIN           s[t] := NOT s[t]            END;
            '&' : BEGIN t := t-1; s[t] := s[t] AND s[t+1]     END;
            '#' : BEGIN t := t-1; s[t] := s[t] OR  s[t+1]     END;
            '>' : BEGIN t := t-1; s[t] := s[t] <=  s[t+1]     END;
            '=' : BEGIN t := t-1; s[t] := s[t]  =  s[t+1]     END
            END; (* CASE *)
    val := s[1]
    END; (* val *)

BEGIN (* table *)
WHILE NOT (v IN occurrences) DO v := succ(v);
IF v > 'z' THEN
    BEGIN
    FOR v := 'a' TO 'z' DO
        IF v IN occurrences
            THEN write(ord(v IN truevars):1,' ');
    writeln('    ',ord(val):1)
    END
  ELSE
    BEGIN
    truevars := truevars + [v]; table(succ(v));
    truevars := truevars - [v]; table(succ(v))
    END
END; (* table *)

(* - - - - -  M A I N  - - - - - *)

BEGIN (* main *)
1:
REPEAT
    write('? ');
    getch;
    IF ch = '.' THEN GOTO 99;
    codeindex := 0; occurrences := [succ('z')];
    formula;
    IF NOT (ch IN ['.','?']) THEN
        error('"." expected                  ');
    writeln;
    IF ch = '?' THEN
        BEGIN
        write('POSTFIX: ');
        FOR i := 1 TO codeindex DO write(code[i]);
        writeln
        END;
    FOR c := 'a' TO 'z' DO
        IF c IN occurrences THEN write(c,' ');
    writeln;
    table('a')
    UNTIL false;
99:
END.
#+end_src

* Exercises and reading

** /Better output/:

Modify the program so that after doing the truth table for a formula it will write =tautology= if the formula was true in every line, =selfcontradiction= if the formula was false in every line, and =contingent= if the formula was true in some lines and false in others.  Looking at large truth table is boring, so some users might prefer merely to be told whether the formula they have typed is a tautology, a self contradiction, or a contingency.  Devise a way of letting the user tell the program whether the entire table is required.

** /Optimisation/:
Implement the optimisation outlined at the end of the description of the table procedure.

** /Values of subformulas/:
Change the program so that in every line it will write the values of all subformulas, directly underneath the operators of the formula as typed in by the user.

** /Symbolic operators/:
Modify the program so that it can use =NOT=, =AND=, =OR=, =IMP= and =IFF= as the operators.

** /Translator/:
If you have devised a way of translating from fully parenthesised infix notation to prefix notation, then you might consider the problem of translating from the minimally parenthesised infix notation with operator precedences to prefix notation.  More likely than not, the method you used for the fully parenthesised notation will not work for the minimally parenthesised notation.

** /Text Macros/:
Devise a way for users to define (upper case) string or text macros, similar to the macro expander in Chapter 4.  Any formula can then be preceded by a sequence of macro definitions, and procedure =getch= has to know whether it is supposed to be reading from the input file or whether it is supposed to retrieve characters from a macro.  An alternative is to allow definitions anywhere in a formula, in that case even definitions should be handled by =getch=, and neither the main program nor the parsing procedures know anything about macros.  Text macros are extremely powerful, they would allow definitions such as =A = = =(p & q)= but also definitions such as =B = = =(((-= or the equally strange =C = = =& r) > s))=.  However, macros such as =B= and =C= can be very error-prone in use.

