05-truth-table-generator.html

<div id="outline-container-5-7" class="outline-3">
<h3 id="sec-5-7"><span class="section-number-3">5.7</span> <i>Syntax Macros</i>:</h3>
<div class="outline-text-3" id="text-5-7">

<p>At the expense of expressive power, the above difficulty can be avoided by insisting that in any macro the body, the right hand side, is actually processed by the parser and that it has to be a complete formula or maybe a factor.  This will allow macro <code>A</code> but not macros <code>B</code> and <code>C</code>.  There are two methods in which the body might be stored: in source form or in translated form.  In both a call to a macro occurs inside a factor, as an atom.  In the first method the body would have to be translated at every call.  In the second method the translated form would merely be copied at every call, clearly this method is more efficient.  Neither text macros nor syntax macros require any change to the stack evaluator.
</p>
</div>

</div>

<div id="outline-container-5-8" class="outline-3">
<h3 id="sec-5-8"><span class="section-number-3">5.8</span> <i>Run Time Calls</i>:</h3>
<div class="outline-text-3" id="text-5-8">

<p>Instead of expanding macros in the parser it is possible not to expand at all but to generate a call to the macro in the postfix code, effectively treating all upper and lower case letters as atoms merely to be distinguished at run time.  In that case the stack evaluator will need an additional case for upper case atoms: it has to stop executing the current postfix formula and instead start executing the postfix formula which is the translated body of the defined atom, and when it has finished with that formula it has to resume executing the previous formula.  There are two ways of implementing this: In one the stack evaluator uses recursion for such calls, and probably this is the simplest method (it is the method that will be used in Chapter 7).  In another method the evaluator saves where it has to resume on an explicit stack of return addresses, and when it has finished executing a defined formula it picks up the return address from that stack (this is the method used in Chapters 13 and 14).
</p>
</div>

</div>

<div id="outline-container-5-9" class="outline-3">
<h3 id="sec-5-9"><span class="section-number-3">5.9</span> <i>A difficult optimisation</i>:</h3>
<div class="outline-text-3" id="text-5-9">

<p>Consider <code>(p v q) &amp; (r v s)</code> in the first four lines of the truth table.  Since the <code>p</code> and <code>q</code> do not change, <code>p v q</code> should not have to be recomputed.  Can you think of an algorithm which avoids this?
</p>
</div>

</div>

<div id="outline-container-5-10" class="outline-3">
<h3 id="sec-5-10"><span class="section-number-3">5.10</span> <i>Other logics</i>:</h3>
<div class="outline-text-3" id="text-5-10">

<p>Study one of the non-classical logic which has 3 or more truth values, see Martin (1987) for some such systems.  Adapt the program for such a logic.
</p>
</div>

</div>

<div id="outline-container-5-11" class="outline-3">
<h3 id="sec-5-11"><span class="section-number-3">5.11</span> <i>Cartesian Product</i>:</h3>
<div class="outline-text-3" id="text-5-11">


<p>
Write a program which repeatedly reads expressions which are Cartesian products of sets and then writes out the set of n-tuples of the product.  Use <code>a</code>..=z= as elements, use <code>{</code> and <code>}</code> to enclose (possibly empty) sets, use <code>*</code> to form products. In the output, use <code>&amp;lt</code> and <code>&gt;</code> to enclose tuples.  Example:
</p>



<pre class="example">input   {ab} * {cde} * {fg}.
output  {&lt;acf&gt;&lt;acg&gt;&lt;adf&gt;&lt;adg&gt;&lt;aef&gt;&lt;aeg&gt;&lt;bcf&gt;&lt;bcg&gt;&lt;bdf&gt;&lt;bdg&gt;&lt;bef&gt;&lt;beg&gt;}
</pre>


<p>
For long output lines you will have to be careful not to exceed the size of Pascal's output buffer, you will have to insert new lines as appropriate.  You will find the method used to generate all combinations of truth values in the truth table program useful here.  (This exercise was suggested to me by Yum Kwok Keung.)
</p>
</div>

</div>

<div id="outline-container-5-12" class="outline-3">
<h3 id="sec-5-12"><span class="section-number-3">5.12</span> <i>Reading</i>:</h3>
<div class="outline-text-3" id="text-5-12">

<p>Compare the program designed in this chapter with the truth table algorithm given by Schagrin, Rapaport and Dipert (1985, pp 108 - 109) and their evaluation algorithm (p 91).  One lesson to learn from their attempt is that formulas just are not strings.  For a recursive descent program which translates arithmetical expressions from minimally parenthesised infix notation to postfix notation, see McCracken (1987, pp 162 - 169).  Many books on compilers will contain something similar.
</p>
</div>

</div>

<div id="outline-container-5-13" class="outline-3">
<h3 id="sec-5-13"><span class="section-number-3">5.13</span> <i>Petri Nets</i>:</h3>
<div class="outline-text-3" id="text-5-13">

<p>Consider a system comprising several propositional variables Any particular change <i>may</i> occur if some variables specific to the change are true and some variables specific to the change are false.  If a particular change does occur, then the variables required to be true or false all change their truth value to the opposite.  One question that arises for such a system is whether there are possible assignments of truth values to the variables for which none of the permitted changes is possible.  A dual question is whether there are assignments which cannot be the result of any of the permitted changes.  1)~Show how the truth table program can be used to answer these two kinds of questions for any particular system of variables and changes.  2)~Modify the program so that instead of reading a formula it reads a system of changes and answers these two questions.  You will have to design a suitable notation for the changes.
</p>
<p>
In the literature systems like the above are known as (simple) Petri nets.  The variables are called <i>places</i>, and they are said to be occupied by a <i>token</i> or to be empty.  The changes are called <i>transitions</i>, and they are always given names.  A transition is said to be <i>enabled</i> if there are so-called <i>input arcs</i> from the places they require to contain a token and there are so-called <i>output arcs</i> to the places they require to be empty.  If an enabled transition does produce its change, it is said to <i>fire</i>, and then tokens are removed from the places connected to the transition by input arcs, and tokens are sent to places connected to the transition by output arcs.  A particular distribution of tokens at a particular time is called a <i>marking</i>.  Nets are often presented as a graph, in particular, a bi-partite graph of places and transitions, with input arcs and output arcs connecting them.  The first question in the previous paragraph asks whether there are markings for which the net will <i>deadlock</i>, the second asks whether there are <i>unreachable</i> markings.  For some more reading, see Chapter~20 and the references given there.  As may be seen, the usual terminology does not make it obvious how close such nets are to propositional logic, and that a simple truth table program can answer significant questions about nets.  In practice, however, nets tend to have so many places that a truth table program is not really adequate.  The truth tree or semantic tableau program in Chapter 10 presents some improvements.
</p>
</div>

</div>

<div id="outline-container-5-14" class="outline-3">
<h3 id="sec-5-14"><span class="section-number-3">5.14</span> <i>Compiling into Pascal</i>:</h3>
<div class="outline-text-3" id="text-5-14">

<p>For large truth tables the <i>interpretation</i> of the postfix code could be too slow.  The same is true for any other internal code that needs interpretation.  It might be faster to <i>compile</i> the formula to be tested into an (inputless) Pascal program which, when run, produces either all lines in the truth table, or only those lines, if any, in which the formula is false, or only the first line, if there is one, in which it is false.  The resultant Pascal program should look like the program in Chapter 1: it will consist of several nested <code>FOR</code> loops and a write statement.  Can you write such a compiler from formulas to Pascal without reading the formula twice?  Without storing the formula internally?  The computation cost for such a system will of course consist of the compile cost and the run cost &mdash; so it will only be worth it for very large formulas.
</p>
</div>

</div>
